qingjinzhilv/esp32s3/MQTT/0-7 pub_and_sub/src/main.cpp
#include <ESP8266WiFi.h>
#include <PubSubClient.h>
#include <Ticker.h>
#include <Arduino.h>

void connectMQTTserver();
void receiveCallback(char* topic, byte* payload, unsigned int length);
void connectWifi();
void subscribeTopic();
void pubMQTTmsg();
void tickerCount();
 
// 设置wifi接入信息(请根据您的WiFi信息进行修改)
const char* ssid = "别摆烂了哦";
const char* password = "00000001";
const char* mqttServer = "broker.hivemq.com";

uint8_t count = 0;
 
Ticker ticker;
WiFiClient wifiClient;                  //连接WiFi用的
PubSubClient mqttClient(wifiClient);    //MQTT通信用的
 
void setup() 
{
  pinMode(LED_BUILTIN, OUTPUT);     // 设置板上LED引脚为输出模式
  pinMode(D3,INPUT_PULLUP);
  digitalWrite(LED_BUILTIN, HIGH);  // 启动后关闭板上LED
  Serial.begin(9600);               // 启动串口通讯
  
  //设置ESP8266工作模式为无线终端模式
  WiFi.mode(WIFI_STA);
  
  // 连接WiFi
  connectWifi();
  
  // 设置MQTT服务器和端口号
  mqttClient.setServer(mqttServer, 1883);
  // 设置MQTT订阅回调函数
  mqttClient.setCallback(receiveCallback);
 
  // 连接MQTT服务器
  connectMQTTserver();

  ticker.attach(1,tickerCount);
}
 
void loop() 
{
  if (mqttClient.connected())   // 如果开发板成功连接服务器
  { 
    if(count >=3)
    {
      pubMQTTmsg();
      count = 0;
    }
    mqttClient.loop();          // 处理信息以及心跳
  } 
  else                          // 如果开发板未能成功连接服务器
  {                      
    connectMQTTserver();        // 则尝试连接服务器
  }
}


// 发布信息
void pubMQTTmsg()
{
  String State = "";
  // 建立发布主题。主题名称以Taichi-Maker-为前缀，后面添加设备的MAC地址。
  // 这么做是为确保不同用户进行MQTT信息发布时，ESP8266客户端名称各不相同，
  String topicString = "qingjin-Pub-" + WiFi.macAddress();
  char publishTopic[topicString.length() + 1];  
  strcpy(publishTopic, topicString.c_str());

  if(digitalRead(D3))
  {
    State = "on";
  }
  else
  {
   State = "off";
  }
  char State_Message[State.length() + 1];
  strcpy(State_Message,State.c_str());
  
  // 实现ESP8266向主题发布信息
  if(mqttClient.publish(publishTopic, State_Message))
  {
    Serial.println("Publish Topic:");Serial.println(publishTopic);
    Serial.println("Publish message:");Serial.println(State_Message);    
  } 
  else 
  {
    Serial.println("Message Publish Failed."); 
  }
}
 
// 连接MQTT服务器并订阅信息
void connectMQTTserver()
{
  // 根据ESP8266的MAC地址生成客户端ID（避免与其它ESP8266的客户端ID重名）
  String clientId = "qingjin-Sub-" + WiFi.macAddress();
 
  // 连接MQTT服务器
  if (mqttClient.connect(clientId.c_str())) 
  { 
    Serial.println("MQTT Server Connected.");
    Serial.println("Server Address:");
    Serial.println(mqttServer);
    Serial.println("ClientId: ");
    Serial.println(clientId);
    subscribeTopic(); // 订阅指定主题
  } 
  else 
  {
    Serial.print("MQTT Server Connect Failed. Client State:");
    Serial.println(mqttClient.state());
    delay(5000);
  }   
}
 
/* 
 * 收到信息后的回调函数
 * 入口参数：主题名、接收的内容、接收的内容的长度
*/
void receiveCallback(char* topic, byte* payload, unsigned int length) 
{
  Serial.print("Message Received [");
  Serial.print(topic);
  Serial.print("] ");
  for (int i = 0; i < length; i++) 
  {
    Serial.print((char)payload[i]);
  }
  Serial.println("");
  Serial.print("Message Length(Bytes) ");     //以字节为单位
  Serial.println(length);
 
  if ((char)payload[0] == '1')    // 如果收到的信息以“1”为开始
  {     
    digitalWrite(BUILTIN_LED, LOW);  // 则点亮LED。
    Serial.println("LED ON");
  } 
  else 
  {                           
    digitalWrite(BUILTIN_LED, HIGH); // 否则熄灭LED。
    Serial.println("LED OFF");
  }
}
 
// 订阅指定主题
void subscribeTopic()
{
  // 建立订阅主题。主题名称以Taichi-Maker-Sub为前缀，后面添加设备的MAC地址。
  // 这么做是为确保不同设备使用同一个MQTT服务器测试消息订阅时，所订阅的主题名称不同
  // 主题不能以/ $为开头，主题内容不能含有空格 还需保持主题简洁明了
  String topicString = "qingjin-Maker-" + WiFi.macAddress() + "/#";   //多级通配符 #
  char subTopic[topicString.length() + 1];  
  strcpy(subTopic, topicString.c_str());

  // 通过串口监视器输出是否成功订阅主题以及订阅的主题名称
  if(mqttClient.subscribe(subTopic))
  {
    Serial.println("Subscrib Topic:");
    Serial.println(subTopic);
  } 
  else 
  {
    Serial.print("Subscribe Fail...");
  }    
}
 
// ESP8266连接wifi
void connectWifi()
{
 
  WiFi.begin(ssid, password);
 
  //等待WiFi连接,成功连接后输出成功信息
  while (WiFi.status() != WL_CONNECTED) 
  {
    delay(1000);
    Serial.print(".");
  }
  Serial.println("");
  Serial.println("WiFi Connected!");  
  Serial.println(""); 
}

void tickerCount()
{
  count ++;
}
